//
// Created by 王存俊 on 2020/6/19.
//

#include <iostream>

int A = 10;
int B = 20;

using namespace std;

int main() {
	cout << (A & B) << endl;  // 01010 & 10100 = 00000 = 0
	cout << (A | B) << endl;  // 01010 & 10100 = 11110 = 30
	cout << (A ^ B) << endl;  // 01010 & 10100 = 11110 = 30

	// 取反: 补码表示
	cout << (~A) << endl;  // ~0000000000001010 = 111111111111110101 => 取反+1 => 0000000000001011 = -11

	cout << (A << 2) << endl;  // 00001010 << 2 = 00101000 = 40
	cout << (A >> 2) << endl;  // 00001010 >> 2 = 00000010 = 2
}